index.org
#+TITLE: The Only Page
#+OPTIONS: timestamp:nil toc:nil author:nil num:nil ^:nil
#+LANGUAGE: en
* *Intro*

This is a minimalist page, so be sure that you are using a browser that is also minimalist enough :-D
  Happy viewing. Written in Emacs, BTW

#+TOC: headlines 2

      
* *FEATURES*

This page can be viewed:

+ without javascript enabled, there is none
+ without image support
+ with any font you like, it should not break the page beyond legibility
+ even on a dumbphone (but you know that from these previous points, right?)
  
* *What I like, do and stuff*

   - Born in Slovakia, 1984, currently living in Prague, CZ
   - I like computers, hamradio, fountain pens, open source
   - Working as a technical support for an adult entertainment website
   - Emacs Enthusiast (more about that lower)
   - Using +openSuse+ and +Fedora+ wherever I can, BSDs even where I can't - UPDATE: I somehow lean towards Ubuntu more and more.
   - GNU Guix fan, but noobie
   - orgmode user, wrote the whole page here
   - name is obviously "Peter Kotrčka" :-D


* *Photography*

I am not the greatest photographer in the world, but it is one of my passions.
Mostly I am using my phone, like every sane person on this planet maybe, but film photography is one of my "offline" hobbies.
When I revisited my camera collection just a few days ago, I have found that currently I am a rangefinder exclusive photographer (in 35 mm format).

Here is a list of cameras I own:

+ unspecified number of Kiev 4 cameras (most likely 3 pieces, if there is no other hidden somewhere) + some Jupiter 8 lenses

+ Leotax -f-

+ Canon 7, unknown model, I do not use that one as much as I would love to because of a pretty dull and hazy rangefinder patch

+ Voigtländer Bessa L

+ Zorki 4

Also, I have a TLR, Yashica D (the one with 3,5 lens), a lovely but not really compact camera and then an unspecified Zeiss Ikon folding camera from 1930's.

Every single camera is in working order (more or less), I got rid of my non working cameras and still have plenty of machines to use.

As for lenses, a bunch of soviel L39 (Leica screw mount) lenses like Jupiter, Industar, the obvious and commonly available stuff.

This article will have an update, I just need to think about what and how I would like to share more details about these cameras.
Because, it would probably be more beneficial for you to see them and / or to see the output (images).

* *Computer Stuff*


** *Emacs*

*** *Why?*

I was a fan of simply solutions for a quite long time. So why would I change that for Emacs?
Well, as many emacs haters will tell you, Emacs is more of an operating system rathern than
text editor. Which is correct, if you do nto have any multmedia ambitions on your computer,
you can do almost everything inside Emacs. It has a huge advantage, usually the same keyboard
shortcuts (bindings) for every "program" inside Emacs. It is the same as for vim users when
they are so so so so much happy about vim key bindings in various terminal programs like
ranger, ...

This is just the beginning of my path, I am only using a few things inside Emacs because
it is very easy to get overwhelmed by so many possibilities. And I would like to do it slightly
different this time, take smaller chunks and go deeper rather than cover everything at once
and nothing well or deep enough. So my first steps are:

- work inside every buffer efficiently, know my key bindings

- setup a few, most used packages and practise by really using them (elfeed, mastodon, dired)

*** *Vanilla?*

Yes, I'm using a vanilla Emacs, no vim key bindings no distributions. I mean, there's nothing
wrong with using Emacs distributions, especially when you want to see what is possible to do
inside Emacs, but a lot of them are just packing a looooot of stuff for programming, so many
different packages. And I have found that I can do a lot of things even without these packages
just because Emacs does everything right :-D Please repeat, Emacs does everything right.

But if I would have to recommend a package, it would be a "vanilla Emacs keybindings" one
like Prelude or Centaur (use [[https://lite.qwant.com][search engine]] to find out more), those seem like well themed,
curated and actively developed Emacs distros.

*** *Theming*

Oh yes, this is important, you need to have a beautiful theme to be able to promote your stuff on
#emacsporn or #unixporn on reddit, right? Oh yes you need. So, as you can find later on this page,
there is a link to a cool greek guy who created a light and dark theme, from which I am using
the light one during the day. Otherwise, just select the "Wombat" one, it is preinstalled and
you will be as happy as I am.

OK, for now, "Leuven" (light theme) it is


*** *I need more info, now*

OK, if this is not enough, visit:

- [[https://protesilaos.com][Protesilaos Stavrou]] and his page, youtube channel, etc.
- System Crafters (again, use search engine to find out the youtube channel)
- [[https://sachachua.com][Sacha Chua]] website for weekly news and other sources


** *+Lenovo+ IBM Plex*

I like to use +Lenovo+ IBM Plex font wherever I can. You can find it in your repo (OpenBSD has it, NetBSD has it, Debian has it, for the rest - use your favourite.. no, use this search engine - [[https://metager.org][click]] to find and download it).


* *Kurrent*

** *What is Kurrent?*

  Kurrent is an old german handwritten script, used primarily prior 1940s when it was banned by the Nazi government. There are multiple variants of this script, the most modern one called Sütterlin.
  There are some slight differences between these variants, however - once you know one of these variants, it is a matter of minutes to pick up those 3-4 characters written in some different way.

