index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Only Page</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">The Only Page</h1>
<div id="outline-container-orge50aa50" class="outline-2">
<h2 id="orge50aa50"><b>Intro</b></h2>
<div class="outline-text-2" id="text-orge50aa50">
<p>
This is a minimalist page, so be sure that you are using a browser that is also minimalist enough :-D
  Happy viewing. Written in Emacs, BTW
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge50aa50"><b>Intro</b></a></li>
<li><a href="#org5f5bc47"><b>FEATURES</b></a></li>
<li><a href="#orgd3dfade"><b>What I like, do and stuff</b></a></li>
<li><a href="#org0271e35"><b>Photography</b></a></li>
<li><a href="#org626df66"><b>Computer Stuff</b></a>
<ul>
<li><a href="#orgc51eec6"><b>Emacs</b></a></li>
<li><a href="#org49b4ef5"><b><del>Lenovo</del> IBM Plex</b></a></li>
</ul>
</li>
<li><a href="#org358615c"><b>Kurrent</b></a>
<ul>
<li><a href="#org7b8ea7d"><b>What is Kurrent?</b></a></li>
<li><a href="#org07125ba"><b>Why Kurrent?</b></a></li>
<li><a href="#orgefd1e18"><b>How Kurrent?</b></a></li>
<li><a href="#org20252fc"><b>Conclusion</b></a></li>
<li><a href="#org2d3f920"><b>Resources</b></a></li>
</ul>
</li>
<li><a href="#orge9d4af4"><b>German language</b></a>
<ul>
<li><a href="#org51cdd19"><b>Auf Deutsch</b></a></li>
</ul>
</li>
<li><a href="#orgb13c26b"><b>Random notes from my life</b></a>
<ul>
<li><a href="#org682a488"><b>2021</b></a></li>
<li><a href="#org15fa9a4"><b>2022</b></a></li>
<li><a href="#org6f47a39"><b>2023</b></a></li>
</ul>
</li>
<li><a href="#org768cfd4"><b>Contacts</b></a></li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-org5f5bc47" class="outline-2">
<h2 id="org5f5bc47"><b>FEATURES</b></h2>
<div class="outline-text-2" id="text-org5f5bc47">
<p>
This page can be viewed:
</p>

<ul class="org-ul">
<li>without javascript enabled, there is none</li>
<li>without image support</li>
<li>with any font you like, it should not break the page beyond legibility</li>
<li>even on a dumbphone (but you know that from these previous points, right?)</li>
</ul>
</div>
</div>

<div id="outline-container-orgd3dfade" class="outline-2">
<h2 id="orgd3dfade"><b>What I like, do and stuff</b></h2>
<div class="outline-text-2" id="text-orgd3dfade">
<ul class="org-ul">
<li>Born in Slovakia, 1984, currently living in Prague, CZ</li>
<li>I like computers, hamradio, fountain pens, open source</li>
<li>Working as a technical support for an adult entertainment website</li>
<li>Emacs Enthusiast (more about that lower)</li>
<li>Using <del>openSuse</del> and <del>Fedora</del> wherever I can, BSDs even where I can't - UPDATE: I somehow lean towards Ubuntu more and more.</li>
<li>GNU Guix fan, but noobie</li>
<li>orgmode user, wrote the whole page here</li>
<li>name is obviously "Peter Kotrčka" :-D</li>
</ul>
</div>
</div>


<div id="outline-container-org0271e35" class="outline-2">
<h2 id="org0271e35"><b>Photography</b></h2>
<div class="outline-text-2" id="text-org0271e35">
<p>
I am not the greatest photographer in the world, but it is one of my passions.
Mostly I am using my phone, like every sane person on this planet maybe, but film photography is one of my "offline" hobbies.
When I revisited my camera collection just a few days ago, I have found that currently I am a rangefinder exclusive photographer (in 35 mm format).
</p>

<p>
Here is a list of cameras I own:
</p>

<ul class="org-ul">
<li>unspecified number of Kiev 4 cameras (most likely 3 pieces, if there is no other hidden somewhere) + some Jupiter 8 lenses</li>

<li>Leotax -f-</li>

<li>Canon 7, unknown model, I do not use that one as much as I would love to because of a pretty dull and hazy rangefinder patch</li>

<li>Voigtländer Bessa L</li>

<li>Zorki 4</li>
</ul>

<p>
Also, I have a TLR, Yashica D (the one with 3,5 lens), a lovely but not really compact camera and then an unspecified Zeiss Ikon folding camera from 1930's.
</p>

<p>
Every single camera is in working order (more or less), I got rid of my non working cameras and still have plenty of machines to use.
</p>

<p>
As for lenses, a bunch of soviel L39 (Leica screw mount) lenses like Jupiter, Industar, the obvious and commonly available stuff.
</p>

<p>
This article will have an update, I just need to think about what and how I would like to share more details about these cameras.
Because, it would probably be more beneficial for you to see them and / or to see the output (images).
</p>
</div>
</div>

<div id="outline-container-org626df66" class="outline-2">
<h2 id="org626df66"><b>Computer Stuff</b></h2>
<div class="outline-text-2" id="text-org626df66">
</div>
<div id="outline-container-orgc51eec6" class="outline-3">
<h3 id="orgc51eec6"><b>Emacs</b></h3>
<div class="outline-text-3" id="text-orgc51eec6">
</div>
<div id="outline-container-orgddf7176" class="outline-4">
<h4 id="orgddf7176"><b>Why?</b></h4>
<div class="outline-text-4" id="text-orgddf7176">
<p>
I was a fan of simply solutions for a quite long time. So why would I change that for Emacs?
Well, as many emacs haters will tell you, Emacs is more of an operating system rathern than
text editor. Which is correct, if you do nto have any multmedia ambitions on your computer,
you can do almost everything inside Emacs. It has a huge advantage, usually the same keyboard
shortcuts (bindings) for every "program" inside Emacs. It is the same as for vim users when
they are so so so so much happy about vim key bindings in various terminal programs like
ranger, &#x2026;
</p>

<p>
This is just the beginning of my path, I am only using a few things inside Emacs because
it is very easy to get overwhelmed by so many possibilities. And I would like to do it slightly
different this time, take smaller chunks and go deeper rather than cover everything at once
and nothing well or deep enough. So my first steps are:
</p>

<ul class="org-ul">
<li>work inside every buffer efficiently, know my key bindings</li>

<li>setup a few, most used packages and practise by really using them (elfeed, mastodon, dired)</li>
</ul>
</div>
</div>

<div id="outline-container-org668935e" class="outline-4">
<h4 id="org668935e"><b>Vanilla?</b></h4>
<div class="outline-text-4" id="text-org668935e">
<p>
Yes, I'm using a vanilla Emacs, no vim key bindings no distributions. I mean, there's nothing
wrong with using Emacs distributions, especially when you want to see what is possible to do
inside Emacs, but a lot of them are just packing a looooot of stuff for programming, so many
different packages. And I have found that I can do a lot of things even without these packages
just because Emacs does everything right :-D Please repeat, Emacs does everything right.
</p>

<p>
But if I would have to recommend a package, it would be a "vanilla Emacs keybindings" one
like Prelude or Centaur (use <a href="https://lite.qwant.com">search engine</a> to find out more), those seem like well themed,
curated and actively developed Emacs distros.
</p>
</div>
</div>

<div id="outline-container-org49be668" class="outline-4">
<h4 id="org49be668"><b>Theming</b></h4>
<div class="outline-text-4" id="text-org49be668">
<p>
Oh yes, this is important, you need to have a beautiful theme to be able to promote your stuff on
#emacsporn or #unixporn on reddit, right? Oh yes you need. So, as you can find later on this page,
there is a link to a cool greek guy who created a light and dark theme, from which I am using
the light one during the day. Otherwise, just select the "Wombat" one, it is preinstalled and
you will be as happy as I am.
</p>

<p>
OK, for now, "Leuven" (light theme) it is
</p>
</div>
</div>


<div id="outline-container-org32cdddb" class="outline-4">
<h4 id="org32cdddb"><b>I need more info, now</b></h4>
<div class="outline-text-4" id="text-org32cdddb">
<p>
OK, if this is not enough, visit:
</p>

<ul class="org-ul">
<li><a href="https://protesilaos.com">Protesilaos Stavrou</a> and his page, youtube channel, etc.</li>
<li>System Crafters (again, use search engine to find out the youtube channel)</li>
<li><a href="https://sachachua.com">Sacha Chua</a> website for weekly news and other sources</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org49b4ef5" class="outline-3">
<h3 id="org49b4ef5"><b><del>Lenovo</del> IBM Plex</b></h3>
<div class="outline-text-3" id="text-org49b4ef5">
<p>
I like to use <del>Lenovo</del> IBM Plex font wherever I can. You can find it in your repo (OpenBSD has it, NetBSD has it, Debian has it, for the rest - use your favourite.. no, use this search engine - <a href="https://metager.org">click</a> to find and download it).
</p>
</div>
</div>
</div>


<div id="outline-container-org358615c" class="outline-2">
<h2 id="org358615c"><b>Kurrent</b></h2>
<div class="outline-text-2" id="text-org358615c">
</div>
<div id="outline-container-org7b8ea7d" class="outline-3">
<h3 id="org7b8ea7d"><b>What is Kurrent?</b></h3>
<div class="outline-text-3" id="text-org7b8ea7d">
<p>
Kurrent is an old german handwritten script, used primarily prior 1940s when it was banned by the Nazi government. There are multiple variants of this script, the most modern one called Sütterlin.
There are some slight differences between these variants, however - once you know one of these variants, it is a matter of minutes to pick up those 3-4 characters written in some different way.
</p>
</div>
</div>
