index.org
** *Why Kurrent?*

    Well, that's a good question. There are not that many use cases, especially when you are an enaglish language native speaker and / or don't know that much of a German. Of course, there are a plenty of materials written in other languages by using this script, but still - tha majority of it is in German.
    For me, it is a good way how to motivete myself to actually learn a bit more German and also to practise handwriting, since I'am also a fountain pen fan. Some of my penfriends are from Germany and (actually to all of them) I'm writing letters to them in Kurrent. In english, so far, but still, at least something, step by step.

** *How Kurrent?*

  There are many materials online on how to learn to write and read Kurrent, a lot of scans of older cookbooks, letters, postcards - so if you are interested, just Metager (or Google, if you must) "kurrent" and you are good to go, learning materials will be on top of your search results. There are also some Facebook groups dedicated to Kurrent / Sütterlin and people there are really welcoming, even if you don't speak German.

** *Conclusion*

  Kurrent is my only other (than Latin) script I know, so it is maybe a bit too early to say this, but I like it very much. It slows me down, I can enjoy writing in it a bit more, it opens new gates to german language, german culture, german history. And actually, learning it was an easy process, just a matter of a day or two. Practising Kurrent handwriting is a never ending process, but still, very enjoyable.
  
** *Resources*

  [[http://www.kurrent-lernen-muecke.de/][Margarete Mücke Kurrent Seite]]

  [[https://www.youtube.com/watch?v=1AgE_4P0cSs][Kurrent writing course - Youtube video (3 hrs)]]

  ... more will be added later

* *German language*

My kryptonite. I wasn't able to learn this language or progress further than to the level where I can watch a youtube video of some kind of an
influencer and get an idea what it is all about. Which, lets be honest, is not a very high level, right? I wanted to improve my language
skilly by using german in my letters to penfriends (in combination with Kurrent), but it is not enough. If you are reading this page and
also if you are learning german, let me know what could help. Duolingo is not working for me either.

December 2022 update: not much of a change, but I feel like I understand a little bit more, even IRL in Germany. 

** *Auf Deutsch*

Hallo, mein name ist Peter und ich schreibe diesen bereich meiner Website in deutscher Sprache. Oder in einer Sprache, die dem Deutschen irgendwie ähnelt.
Die deutsche Sprache is mein Kryptonit, merh also "Hallo" sagen kann ich nicht lernen. Hilfe, bitte :-(

* *Random notes from my life*

** *2021*

*** *May 9* - edited [[http://pkotrcka.inlisp.org/emacs.html][emacs.html]] page as a practise in editing inside Emacs. I also updated
my RSS feed sources, got rid of reddit junk (or at least the most of it) and put some lower
traffic, but interested sources

*** *May 9* - making a short video about my workflow in #Emacs. And as usual, I can nto type when I
also record my video :D This is a document made in *org* which will be exported to HTML and uploaded to my
FTP. Nothing fancy, nothing special, maybe I will add a link to something like Alex's blog. Alex Schroeder is
another Emacs enthusiast, so why not? Here it is: [[https://alexschroeder.ch][Alex's page]] 

OK, now I have to find a way how to use ffmpeg and make this video faster (speed up). So we will use eww, of
course :D Maybe I have found it, it shoult work like this:

#+BEGIN_SRC shell
ffmpeg -i input.mkv -filter:v "setpts=0.5*PTS" output.mkv
#+END_SRC


Hmmm, should I put the code into the code section? Let's see if I could use org mode help here.
I was able to do that, nice :-D And now, export the document and upload it onto FTP.

*** *June 5*

On my path to find a better web browser, I am back on Vivaldi. As you may already know, I have a few computers, some of them are powerful enough not to show off the lack of speed when using Firefox.

But I also have a underpowered UMAX laptop which shows this pretty happily. So my quest was, to find if there is a greener grass on the Chromium part of the garden. And it seems there is.

I used Vivaldi and yes yes yes, there is a significant speed increase. Probably it will be worse with RAM usage, but that I can live with.

I know that my ideal web browser would be Iridium, however - those german guys are not that regular with updates, also there are multiple versions for different Linux branches / distributions and each one of them is based on a different version.

Not to mention unresolved dependencies on my current distro. Yes yes, it is open source, I can bouild it - but can you imagine building it on this kind of laptop? :-D

