index.org
*** *July 4*

Not a Independence day themed post.

However, still something to celebrate. I have a new computer, I decided to go for a secondary laptop since I will spend a lot of time at the office during the night.

And I miss having an UNIX system available with everything ready and installed for my needs. Of course, there is SDF, but still, own HW is own HW.

There was a small and unexpected surprise when I bought a laptop that was my first choice. ASUS ExpertBook, 14", no Windows, yes RJ-45, FullHD display, good price. However, 
I like to use Emacs as my editor of choice (and for other things as well) and guess what. I was so lucky with my first laptop (HP x360) where keyboard rollover was functioning as
expected, that I was not expecting it to be different on any other laptop. But it is. And not like "ASUS has it, HP not", it is different, model after model. It might look similar but the
keyboard behaves completely different. So, it went back and I spent my sunday afternoon by trying (lucky for me, I was able to test this) laptops that are within my budget, have a 
decent keyboard with working rollover, have non-qualcomm wifi, etc. And tadaaaa, the winner is ASUS again, something with tiger lake i5 (I would like to try an AMD laptop, but those are
still rare), 8 GB of RAM, some SSD inside. And I like it. maybe even a bit more than my HP, so I am not really sure which one will accompany me at the office. I wanted to leave the 
better machine at home, but now it might be this ASUS (yes, I already installed #emacs and typing this on this laptop).

Fedora works there like a charm - again, maybe even better than the HP with a slightly older chipset. I was a bit worried about the smaller touchpad but it is a good one, so
no problems here.

I will update :-)

*July 30*

On my other laptop that I left at work I installed the latest devel version of Ubuntu, Impish Indri. It was my only chance since I only have had one USB drive with me. 
So if that would not work, I would be screwed. But it worked. It has its own flaws, of course, it is still 3 months away from release, but it works. And what I need?
Simple, Emacs, Vivaldi (yeah, will explain later), some video player and a system base taht will not crash just like that. And for that, Ubuntu devel in the middle of the
development cycle is more than enough.

This, of course, was written on that very system :-D

*** *August 1*

For the first two weeks, my new ASUS laptop was more of a testing platfomr, I always like to try what is possible, what works and what does not.
What a surprise was that I have found Ubuntu is not possible to install (at least not by deafult) because it can not see the internal drive.
That's 21.04, of course, but I am not a lazy guy so I tested a release that will become 21.10 one day and all fo the sudden, it sees the drive and works correctly.
Not sure what happened, maybe a kernel version bump (5.11 in stable, 5.13 in the future release), maybe something else. But everything works.

So far so good - Fedora works, Ubuntu (will) works, openSuse Tumbleweed works. Manjaro works, but... Yes, there is still some but(t), it has other issues, which are
probably not HW related.

Hey, maybe you would like to actually know what laptop it is - so the model name is Asus X415EA-EB037T (probably a local variant, but in any case - Tiger Lake i5 CPU,
8/256 RAM/storage). I know that it is not a super expensive laptop, but I really like it. I know, I know, you will tell me that the display is terrible (yes, there are 
slight light leaks here and there when the backlight is turned high), the keyboard is terrible (it is not, I Like typing on it and it even has T shaped arrow keys layout 
(but yes, still half height, but at least something). Sound is OK, I can not really comapre it to the HP which has front facing speakers above keyboard, but at least the 
sound output into headphones is very decent.

I am not sure about the battery life, all of my laptops are actually more of a desktop replacement with a tiny footprint :-D so... But, I would guess 5+ hours with
an average load, amybe a bit more with "content consuming". What I Like, on the other hand is the fact that it is quiet, yet still cool. My HP crank up fans very quickly 
when there is a CPU load and it is pretty loud. ASUS keeps it quiet for a much much longer time.

So overall, I am happy, I typed a lot of text on this laptop, listened to a good music, watched some videos, everything works as expected. I know that it is a bit too
early for recommendation, but so far, so good.

** *2022*

*** *February 5, 2022*

New Year, new adventures. So, what am I going to do this year?

A few resolutions like less coffee, more quality coffee, less GAS (gear acquisition syndrome) and impulse purchases. That's normal and I will probably break those within a few months.

Then, I would like to get my german into the "conversational" level, more than just the "hardly able to say hello" level I am stuck on for years.

Also, I would love to learn something useful on computers. Programming always fascinated me and it would not be that hard to learn (I think) but I also know, what is probably the biggest issue.
I do not have any project I could do long term that would grow with me, has a meaning, ...
Os instead of that, I could just try to learn to script, shell script. That is something I could then use on a daily basis. This needs more thinking and you'll be updated.

Of course, less social media.. right?

*** *April 24*

Somehow, all that war and everything got me, 2 months after the start. Two years of COVID and now this. Poor people in Ukraine, prices of everything skyrocketed, Russia is still an idiocracy.
That's not good, not good at all. What I' mtrying now is taht I will avoid news sites, if that helps my mood a bit. I will also start night shifts again, so I'll try to focus on programming and
learning some new computer stuff.

*** *May 11*

Updated my [[http://pkotrcka.inlisp.org/index.html][main page]] to include almost everything that is possible to put on one page, the only exception is this notepad. And I like it, it is really readable even on a phone. It's not for people that like
videos or such, but rather for someone who likes to read a little bit. I will add even more stuff later in the late 90s fashion - html in its best :-D 

*** *May 13*

Removed the "What I do not like" section, started to type about NetBSD and also added somwthing about german language. We are getting there.

*** *May 14*

I have created a new Youtube channel for my adventures with computers. As an Emacs user
I have selected a name that is very appropriate - AmateurVimer :-D Content is really
easy to create and it seems to be fun. Will see how I will feel about it later on.

