index.html

<div id="outline-container-orge92351a" class="outline-4">
<h4 id="orge92351a"><b>July 4</b></h4>
<div class="outline-text-4" id="text-orge92351a">
<p>
Not a Independence day themed post.
</p>

<p>
However, still something to celebrate. I have a new computer, I decided to go for a secondary laptop since I will spend a lot of time at the office during the night.
</p>

<p>
And I miss having an UNIX system available with everything ready and installed for my needs. Of course, there is SDF, but still, own HW is own HW.
</p>

<p>
There was a small and unexpected surprise when I bought a laptop that was my first choice. ASUS ExpertBook, 14", no Windows, yes RJ-45, FullHD display, good price. However, 
I like to use Emacs as my editor of choice (and for other things as well) and guess what. I was so lucky with my first laptop (HP x360) where keyboard rollover was functioning as
expected, that I was not expecting it to be different on any other laptop. But it is. And not like "ASUS has it, HP not", it is different, model after model. It might look similar but the
keyboard behaves completely different. So, it went back and I spent my sunday afternoon by trying (lucky for me, I was able to test this) laptops that are within my budget, have a 
decent keyboard with working rollover, have non-qualcomm wifi, etc. And tadaaaa, the winner is ASUS again, something with tiger lake i5 (I would like to try an AMD laptop, but those are
still rare), 8 GB of RAM, some SSD inside. And I like it. maybe even a bit more than my HP, so I am not really sure which one will accompany me at the office. I wanted to leave the 
better machine at home, but now it might be this ASUS (yes, I already installed #emacs and typing this on this laptop).
</p>

<p>
Fedora works there like a charm - again, maybe even better than the HP with a slightly older chipset. I was a bit worried about the smaller touchpad but it is a good one, so
no problems here.
</p>

<p>
I will update :-)
</p>

<p>
<b>July 30</b>
</p>

<p>
On my other laptop that I left at work I installed the latest devel version of Ubuntu, Impish Indri. It was my only chance since I only have had one USB drive with me. 
So if that would not work, I would be screwed. But it worked. It has its own flaws, of course, it is still 3 months away from release, but it works. And what I need?
Simple, Emacs, Vivaldi (yeah, will explain later), some video player and a system base taht will not crash just like that. And for that, Ubuntu devel in the middle of the
development cycle is more than enough.
</p>

<p>
This, of course, was written on that very system :-D
</p>
</div>
</div>

<div id="outline-container-org7f241e9" class="outline-4">
<h4 id="org7f241e9"><b>August 1</b></h4>
<div class="outline-text-4" id="text-org7f241e9">
<p>
For the first two weeks, my new ASUS laptop was more of a testing platfomr, I always like to try what is possible, what works and what does not.
What a surprise was that I have found Ubuntu is not possible to install (at least not by deafult) because it can not see the internal drive.
That's 21.04, of course, but I am not a lazy guy so I tested a release that will become 21.10 one day and all fo the sudden, it sees the drive and works correctly.
Not sure what happened, maybe a kernel version bump (5.11 in stable, 5.13 in the future release), maybe something else. But everything works.
</p>

<p>
So far so good - Fedora works, Ubuntu (will) works, openSuse Tumbleweed works. Manjaro works, but&#x2026; Yes, there is still some but(t), it has other issues, which are
probably not HW related.
</p>

<p>
Hey, maybe you would like to actually know what laptop it is - so the model name is Asus X415EA-EB037T (probably a local variant, but in any case - Tiger Lake i5 CPU,
8/256 RAM/storage). I know that it is not a super expensive laptop, but I really like it. I know, I know, you will tell me that the display is terrible (yes, there are 
slight light leaks here and there when the backlight is turned high), the keyboard is terrible (it is not, I Like typing on it and it even has T shaped arrow keys layout 
(but yes, still half height, but at least something). Sound is OK, I can not really comapre it to the HP which has front facing speakers above keyboard, but at least the 
sound output into headphones is very decent.
</p>

<p>
I am not sure about the battery life, all of my laptops are actually more of a desktop replacement with a tiny footprint :-D so&#x2026; But, I would guess 5+ hours with
an average load, amybe a bit more with "content consuming". What I Like, on the other hand is the fact that it is quiet, yet still cool. My HP crank up fans very quickly 
when there is a CPU load and it is pretty loud. ASUS keeps it quiet for a much much longer time.
</p>

<p>
So overall, I am happy, I typed a lot of text on this laptop, listened to a good music, watched some videos, everything works as expected. I know that it is a bit too
early for recommendation, but so far, so good.
</p>
</div>
</div>
</div>

<div id="outline-container-org15fa9a4" class="outline-3">
<h3 id="org15fa9a4"><b>2022</b></h3>
<div class="outline-text-3" id="text-org15fa9a4">
</div>
<div id="outline-container-org97af879" class="outline-4">
<h4 id="org97af879"><b>February 5, 2022</b></h4>
<div class="outline-text-4" id="text-org97af879">
<p>
New Year, new adventures. So, what am I going to do this year?
</p>

<p>
A few resolutions like less coffee, more quality coffee, less GAS (gear acquisition syndrome) and impulse purchases. That's normal and I will probably break those within a few months.
</p>

<p>
Then, I would like to get my german into the "conversational" level, more than just the "hardly able to say hello" level I am stuck on for years.
</p>

<p>
Also, I would love to learn something useful on computers. Programming always fascinated me and it would not be that hard to learn (I think) but I also know, what is probably the biggest issue.
I do not have any project I could do long term that would grow with me, has a meaning, &#x2026;
Os instead of that, I could just try to learn to script, shell script. That is something I could then use on a daily basis. This needs more thinking and you'll be updated.
</p>

<p>
Of course, less social media.. right?
</p>
</div>
</div>

<div id="outline-container-org0664ac8" class="outline-4">
<h4 id="org0664ac8"><b>April 24</b></h4>
<div class="outline-text-4" id="text-org0664ac8">
<p>
Somehow, all that war and everything got me, 2 months after the start. Two years of COVID and now this. Poor people in Ukraine, prices of everything skyrocketed, Russia is still an idiocracy.
That's not good, not good at all. What I' mtrying now is taht I will avoid news sites, if that helps my mood a bit. I will also start night shifts again, so I'll try to focus on programming and
learning some new computer stuff.
</p>
</div>
</div>

<div id="outline-container-org5444fc5" class="outline-4">
<h4 id="org5444fc5"><b>May 11</b></h4>
<div class="outline-text-4" id="text-org5444fc5">
<p>
Updated my <a href="http://pkotrcka.inlisp.org/index.html">main page</a> to include almost everything that is possible to put on one page, the only exception is this notepad. And I like it, it is really readable even on a phone. It's not for people that like
videos or such, but rather for someone who likes to read a little bit. I will add even more stuff later in the late 90s fashion - html in its best :-D 
</p>
</div>
</div>

<div id="outline-container-org155bb23" class="outline-4">
<h4 id="org155bb23"><b>May 13</b></h4>
<div class="outline-text-4" id="text-org155bb23">
<p>
Removed the "What I do not like" section, started to type about NetBSD and also added somwthing about german language. We are getting there.
</p>
</div>
</div>

<div id="outline-container-org380965d" class="outline-4">
<h4 id="org380965d"><b>May 14</b></h4>
<div class="outline-text-4" id="text-org380965d">
<p>
I have created a new Youtube channel for my adventures with computers. As an Emacs user
I have selected a name that is very appropriate - AmateurVimer :-D Content is really
easy to create and it seems to be fun. Will see how I will feel about it later on.
</p>
</div>
</div>
