index.org
*** *June 1*

A lot has happened. I deleted this page, started to create a new one, also changed my mastodon instance.
Then I have found this copy of the page on my laptop so re-decided to edit this stuff and give it another try.
My roommate will leave, that means much more space in the apartment but also a higher rent :-(
I am so much behind my penpals letter writing, I *have to* do something about it.
It's been three months since I wrote an article about the laptop I'm using right now and it hasn't been published yet.
I wonder if it ever gets published.

*** *August 24*

Nothing much has happened, I was on my holiday in Germany. It was nice, I will miss that.

*** *December 10*

I have restarted my phlog on gopher. Not sure how that will end, that's a problem of the future Peter :-D Also, I am doing our social media in the company partially again.
I won't lie, it is partially about the money, but most of it, maybe 70% - I need to do something else than my regular job just to be able to stay in this company.
And I'm waiting for something to come up that will be a new challenge for me, something creative (which, to be honest, this social media is NOT). We'll see what it'll become.

** *2023*

*** *January 3*

Happy New Year everyone, I actually remembered to update this page early on, so.. New Year resolutions? More Emacs for me, maybe some scripting and someone on Mastodon told me to
look into LaTeX, so.. If I'm going to publish my silly beer and coffee newspapers for my colleagues, that could be useful.
And of course, eatl more healthy, less sugar, less garbage food, ...

*** *January 7*

I have updated the Programming section, added some resolutions for 2023 there. Installed Fedora Rawhide on my spare work laptop, we'll see how it'll hold up.
I wanted to record a second episode of my beer podcast, to have at least a few episodes before I will star a channel or podcast itself but Audacity froze the whole computer.
Not sure, how, don't ask me, but it stopped after 7 minutes and nothing was saved. Honestly, it wasn't my best attempt anyway, but.. still, so much time wasted.
I bought a train ticket to Germany, Freiberg. You probably do not know the city, it is among smaller ones, but there is a brewery with probably the best Kellerbier I have ever tried.
It is possible to buy that beer in Dresden as well, but.. I want to see if the place of origin is the best place to drink such a special beer.
And I like trains, this will be another trip with Deutsche Bahn (from Dresden to Freiberg) and České dráhy (Prague -> Dresden). I am thinking about creating a dedicated train photo
Instagram account. I love trains, so why now? I know there are dedicated Mastodon instances for train enthusiasts as well, but IG should be a starting point. And from there, we'll see.

*** *January 31*

It was a pretty decent January. I was on a few trips, Germany again, of course. A lot of good beer, a lot of nice experiences. Not something I need to elaborate too much,
but yeah - a decent January. Now I am back on night shifts, so maybe the February will be more about learning new stuff. Still not sure what that will be. But I'll update you.

*** *February 4*

Pissed that my ISP / mobile services provider screwed my bill again, I have to go there AGAIN and describe all about my discounts and everything.
Plus, they have increased prices by 9%, so I am thinking about saying goodbye to them. There are other options available. Maybe a little bit less comfortable, but still.
As for this page, I removed a lot of stuff that is not relevant anymore, to clean the page a bit. I think you won't miss them, it was just a bloat.

*** *February 20*

Updates: deleted my Google account completely, switched to Huawei phone (no need of Google account there), FEB-21 will be my mobile services provider switch.
Moved to neocities because for some reason, sdf revoked my ftp access.

*** *February 25*

Mobile services provides changed successfully. For some reason, I am unable to access FTP on SDF so I neede to change my webhosting.
Sadly, the most convenient service that allows hosting my html as well as org files is github. So I have a website there :-(
I am not happy about it, but that's the way it is for now. BTW, I already have a follower on guthub. Not sure who and why. Mostly why.
On Sunday, February 26, I will go for a beer degustation again. We need (me and my colleague) to try some new beers and have a discussion
about them.
During the night, I was trying to compile and config FVWM3. Compilation was super easy, configuration was not. I was able to achieve some
things, but then I realized that all I wanted to create was another ratpoison, so I went back to ratpoison :-D
Added some new key bindings to it, so that might help using it on this poor laptop with more ease.

*** *March 5*

Not that much happening right now as I am stuck at work. I did manage to do a German visit early in the month, so now I can plan my future
trips much better. My new colleaue might take all those night shifts, so there is a slight chance of me being a daily guy again :-D
But of course, I am trying to be realistic about it and wait for the actual result.

*** *March 15*

I have changed my emacs theme to ef-themes (by Prot) in the Autumn colors, pretty nice and warm tones, earthy. Pleasant to look at.

*** *March 19*

I made a lot of videos about Emacs. Not sure if that will be something regular, but so far - I like doing that.

* *Contacts*

Electronic mail: pkotrcka (at) vivaldi (dot) net

Mastodon: @peterkotrcka@nrw.social

*Modified - March 19, 2023* - last mod: blog
