index.html

<div id="outline-container-orgd7c44f9" class="outline-4">
<h4 id="orgd7c44f9"><b>June 1</b></h4>
<div class="outline-text-4" id="text-orgd7c44f9">
<p>
A lot has happened. I deleted this page, started to create a new one, also changed my mastodon instance.
Then I have found this copy of the page on my laptop so re-decided to edit this stuff and give it another try.
My roommate will leave, that means much more space in the apartment but also a higher rent :-(
I am so much behind my penpals letter writing, I <b>have to</b> do something about it.
It's been three months since I wrote an article about the laptop I'm using right now and it hasn't been published yet.
I wonder if it ever gets published.
</p>
</div>
</div>

<div id="outline-container-org170ca74" class="outline-4">
<h4 id="org170ca74"><b>August 24</b></h4>
<div class="outline-text-4" id="text-org170ca74">
<p>
Nothing much has happened, I was on my holiday in Germany. It was nice, I will miss that.
</p>
</div>
</div>

<div id="outline-container-org368a1a0" class="outline-4">
<h4 id="org368a1a0"><b>December 10</b></h4>
<div class="outline-text-4" id="text-org368a1a0">
<p>
I have restarted my phlog on gopher. Not sure how that will end, that's a problem of the future Peter :-D Also, I am doing our social media in the company partially again.
I won't lie, it is partially about the money, but most of it, maybe 70% - I need to do something else than my regular job just to be able to stay in this company.
And I'm waiting for something to come up that will be a new challenge for me, something creative (which, to be honest, this social media is NOT). We'll see what it'll become.
</p>
</div>
</div>
</div>

<div id="outline-container-org6f47a39" class="outline-3">
<h3 id="org6f47a39"><b>2023</b></h3>
<div class="outline-text-3" id="text-org6f47a39">
</div>
<div id="outline-container-orgd398fed" class="outline-4">
<h4 id="orgd398fed"><b>January 3</b></h4>
<div class="outline-text-4" id="text-orgd398fed">
<p>
Happy New Year everyone, I actually remembered to update this page early on, so.. New Year resolutions? More Emacs for me, maybe some scripting and someone on Mastodon told me to
look into LaTeX, so.. If I'm going to publish my silly beer and coffee newspapers for my colleagues, that could be useful.
And of course, eatl more healthy, less sugar, less garbage food, &#x2026;
</p>
</div>
</div>

<div id="outline-container-org8f11a03" class="outline-4">
<h4 id="org8f11a03"><b>January 7</b></h4>
<div class="outline-text-4" id="text-org8f11a03">
<p>
I have updated the Programming section, added some resolutions for 2023 there. Installed Fedora Rawhide on my spare work laptop, we'll see how it'll hold up.
I wanted to record a second episode of my beer podcast, to have at least a few episodes before I will star a channel or podcast itself but Audacity froze the whole computer.
Not sure, how, don't ask me, but it stopped after 7 minutes and nothing was saved. Honestly, it wasn't my best attempt anyway, but.. still, so much time wasted.
I bought a train ticket to Germany, Freiberg. You probably do not know the city, it is among smaller ones, but there is a brewery with probably the best Kellerbier I have ever tried.
It is possible to buy that beer in Dresden as well, but.. I want to see if the place of origin is the best place to drink such a special beer.
And I like trains, this will be another trip with Deutsche Bahn (from Dresden to Freiberg) and České dráhy (Prague -&gt; Dresden). I am thinking about creating a dedicated train photo
Instagram account. I love trains, so why now? I know there are dedicated Mastodon instances for train enthusiasts as well, but IG should be a starting point. And from there, we'll see.
</p>
</div>
</div>

<div id="outline-container-org020ddd1" class="outline-4">
<h4 id="org020ddd1"><b>January 31</b></h4>
<div class="outline-text-4" id="text-org020ddd1">
<p>
It was a pretty decent January. I was on a few trips, Germany again, of course. A lot of good beer, a lot of nice experiences. Not something I need to elaborate too much,
but yeah - a decent January. Now I am back on night shifts, so maybe the February will be more about learning new stuff. Still not sure what that will be. But I'll update you.
</p>
</div>
</div>

<div id="outline-container-orgee0cd47" class="outline-4">
<h4 id="orgee0cd47"><b>February 4</b></h4>
<div class="outline-text-4" id="text-orgee0cd47">
<p>
Pissed that my ISP / mobile services provider screwed my bill again, I have to go there AGAIN and describe all about my discounts and everything.
Plus, they have increased prices by 9%, so I am thinking about saying goodbye to them. There are other options available. Maybe a little bit less comfortable, but still.
As for this page, I removed a lot of stuff that is not relevant anymore, to clean the page a bit. I think you won't miss them, it was just a bloat.
</p>
</div>
</div>

<div id="outline-container-orge6a0bfa" class="outline-4">
<h4 id="orge6a0bfa"><b>February 20</b></h4>
<div class="outline-text-4" id="text-orge6a0bfa">
<p>
Updates: deleted my Google account completely, switched to Huawei phone (no need of Google account there), FEB-21 will be my mobile services provider switch.
Moved to neocities because for some reason, sdf revoked my ftp access.
</p>
</div>
</div>

<div id="outline-container-orga5813bd" class="outline-4">
<h4 id="orga5813bd"><b>February 25</b></h4>
<div class="outline-text-4" id="text-orga5813bd">
<p>
Mobile services provides changed successfully. For some reason, I am unable to access FTP on SDF so I neede to change my webhosting.
Sadly, the most convenient service that allows hosting my html as well as org files is github. So I have a website there :-(
I am not happy about it, but that's the way it is for now. BTW, I already have a follower on guthub. Not sure who and why. Mostly why.
On Sunday, February 26, I will go for a beer degustation again. We need (me and my colleague) to try some new beers and have a discussion
about them.
During the night, I was trying to compile and config FVWM3. Compilation was super easy, configuration was not. I was able to achieve some
things, but then I realized that all I wanted to create was another ratpoison, so I went back to ratpoison :-D
Added some new key bindings to it, so that might help using it on this poor laptop with more ease.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org768cfd4" class="outline-2">
<h2 id="org768cfd4"><b>Contacts</b></h2>
<div class="outline-text-2" id="text-org768cfd4">
<p>
Electronic mail: pkotrcka (at) vivaldi (dot) net
</p>

<p>
Mastodon: @peterkotrcka@nrw.social
</p>

<p>
<b>Modified - February 25, 2023</b> - last mod: blog
</p>
</div>
</div>
</div>
</body>
</html>
